Documents/ВводОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.МатериалыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацийВводаОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БонусыКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиВВалюте</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыВЭксплуатации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПерсоналом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыНаСкладах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БонусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыКонтрагентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВводОстатков/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ВзаиморасчетыСКонтрагентами Тогда
		ПроверяемыеРеквизиты.Добавить("Организация");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очистим лишние таблицы
	ИмяТипаОперации = "";
	Если Не ТипОперации.Пустая() Тогда
		ИмяТипаОперации = Метаданные.Перечисления.ТипыОперацийВводаОстатков.ЗначенияПеречисления.Получить(Перечисления.ТипыОперацийВводаОстатков.Индекс(ТипОперации)).Имя;
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из Метаданные().ТабличныеЧасти Цикл
		Если ТабличнаяЧасть.Имя = ИмяТипаОперации Тогда
			Продолжить;
		КонецЕсли;
				
		ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();		
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	// Бонусы контрагентов
	Движения.БонусыКонтрагентов.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из БонусыКонтрагентов Цикл
		
		Движение = Движения.БонусыКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока, "Контрагент, ДисконтнаяКарта, Сумма");
		
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
	КонецЦикла;
	
	// Взаиморасчеты с контрагентами
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из ВзаиморасчетыСКонтрагентами Цикл
		
		//Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		//ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
		//
		//Движение.Период = Дата;
		//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		СуммаВВалютеУчета = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = ТекущаяСтрока.Контрагент;
		Движение.Договор = ТекущаяСтрока.Договор;
		//Движение.Документ = Ссылка;
		// долг покупателя или аванс поставщику (долг перед компанией)
		Если ТекущаяСтрока.Сумма > 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = СуммаВВалютеУчета;
			
		// аванс покупателя или долг поставщику (долги компании)
		ИначеЕсли ТекущаяСтрока.Сумма < 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = -СуммаВВалютеУчета;
		КонецЕсли;
		
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = ТекущаяСтрока.Контрагент;
		Движение.Договор = ТекущаяСтрока.Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = ТекущаяСтрока.Сумма;
		
	КонецЦикла;
	
	// #14173
	//Распределение РасчетыПоЗаказам 
	// расчеты с покупателем 
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из ВзаиморасчетыСКонтрагентами Цикл
		Если ТекущаяСтрока.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументРасчета) Тогда
			Продолжить;
		КонецЕсли;
		НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.ДокументРасчета));
		Если НайденныйВидДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = ТекущаяСтрока.ДокументРасчета;
		Движение.Контрагент = ТекущаяСтрока.ДокументРасчета.Контрагент;
		Если ТекущаяСтрока.Сумма < 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; // как ПКО
			Движение.Сумма = -ТекущаяСтрока.Сумма;
		Иначе 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; // как РКО
			Движение.Сумма = ТекущаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	// #13511 убрано
	// Взаиморасчеты с контрагентами в валюте
	//Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	//Для Каждого ТекущаяСтрока Из УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиВВалюте Цикл
	//	
	//	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	//	ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
	//	
	//	Движение.Период = Дата;
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	
	//КонецЦикла;
	
	// Денежные средства
	Движения.ДенежныеСредства.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из ДенежныеСредства Цикл
		
		Движение = Движения.ДенежныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока, "СчетКасса, Сумма");
		
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Валюта = Валюта;
		
	КонецЦикла;
	
	// Материалы в эксплуатации
	Движения.МатериалыВЭксплуатации.Записывать = Истина;		
	Для Каждого ТекущаяСтрока Из МатериалыВЭксплуатации Цикл
		
		Движение = Движения.МатериалыВЭксплуатации.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока, "Ответственный, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Количество, Сумма");
		
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = ОрганизацияТоваров;
		
	КонецЦикла;
	
	// Расчеты с персоналом
	Движения.РасчетыСПерсоналом.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РасчетыСПерсоналом Цикл
		
		Движение = Движения.РасчетыСПерсоналом.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		//Движение.ПериодРегистрации = ?(ИспользуетсяПериодРегистрации, ПериодРегистрации, Дата(1,1,1));
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекущаяСтрока.Сотрудник;
		//Движение.ВидНачисления = 
		//Движение.ОбъектВыработки = 
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		
	КонецЦикла;
	
	// Расчеты с подотчетниками
	Движения.РасчетыСПодотчетниками.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РасчетыСПодотчетниками Цикл
		
		Движение = Движения.РасчетыСПодотчетниками.Добавить();		
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекущаяСтрока.Сотрудник;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);

	КонецЦикла;
		
	// Товары на складах	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из ТоварыНаСкладах Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = ОрганизацияТоваров;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
